mach-3-tunnel-with-step/rhoCentralFoam20/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains X;

/*
    Main methods are:
    1) Geometric: "simple"; "hierarchical", with ordered sorting, e.g. xyz, yxz
    2) Scotch: "scotch", when running in serial; "ptscotch", running in parallel
*/

method              hierarchical;

simpleCoeffs
{
    n               (X X 1); // total must match numberOfSubdomains
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (X X 1); // total must match numberOfSubdomains
    delta           0.001;
    order           xyz;
}


// ************************************************************************* //
